app/Controllers/AvisController.php

    public function index(): string
    {
        $session = session();
        $user = $session->get('user');
        if (!$user) {
            return redirect()->to('/')->with('error', 'Veuillez vous connecter.');
        }
        $utilisateurModel = new UtilisateurModel();
        $utilisateur = $utilisateurModel->find($user['id']);

        if (!$utilisateur) {
            return redirect()->to('/')->with('error', 'Utilisateur introuvable.');
        }
        $commentaireModel = new CommentaireModel();
        $avis = $commentaireModel->where('joueur_id', $user['id'])->findAll();
---
SELECT *
FROM `utilisateur`
WHERE `utilisateur`.`id` = '76'
SELECT *
FROM `commentaire`
WHERE `joueur_id` = '76'

    public function update($id)
    {
        $session = session();
        $user = $session->get('user');
        if (!$user || !isset($user['id'])) {
            return redirect()->to('/')->with('error', 'Vous devez être connecté pour modifier un avis.');
        }

        $commentaireModel = new CommentaireModel();
        $avis = $commentaireModel->find($id);
---
SELECT *
FROM `commentaire`
WHERE `commentaire`.`id` = '11'

            'note' => $this->request->getPost('note'),
        ];

        if (!$commentaireModel->update($id, $data)) {
---
UPDATE `commentaire` SET `titre` = 'pppppppppp', `contenu` = 'wwwwwwwww', `note` = '3', `updated_at` = '2024-12-07 18:02:01'
WHERE `commentaire`.`id` IN ('11')