app/Controllers/Home.php

SELECT COUNT(*) AS `numrows` FROM `terrains`
---
    public function index()
    {
        $data['today_date'] = date('D, j M Y');
        $model = new ReservationssModel();
        $data['reservationCounts'] = $model->getReservationCounts();

        $utilisateurModel = new UtilisateurModel();

        $data['totalUsers'] = $utilisateurModel->countAllUsers();

        $terrainModel = new TerrainModel();

        $data['totalTerrains'] = $terrainModel->countAll();