app/Controllers/JoueurHomeController.php

    public function index()
    {
        $session = session();
        $user = $session->get('user');

        if (!$user) {
            return redirect()->to('/')->with('error', 'Veuillez vous connecter.');
        }

        $utilisateurModel = new UtilisateurModel();
        $utilisateur = $utilisateurModel->find($user['id']);

        if (!$utilisateur) {
            return redirect()->to('/')->with('error', 'Utilisateur introuvable.');
        }
        $terrainsModel = new TerrainsModel();
        $reservationsModel = new ReservationsModel();
        $avisModel = new CommentaireModel();
        $terrains = $terrainsModel->countAllResults();
        $reservations = $reservationsModel->countAllResults();
        $avis = $avisModel->countAllResults();
---
SELECT *
FROM `utilisateur`
WHERE `utilisateur`.`id` = '76'
SELECT COUNT(*) AS `numrows`
FROM `terrains`
SELECT COUNT(*) AS `numrows`
FROM `reservations`
SELECT COUNT(*) AS `numrows`
FROM `commentaire`