app/Controllers/LoginController.php

SELECT *
FROM `utilisateur`
WHERE LOWER(email) = 'salah22j@gmail.com'
 LIMIT 1
---
    public function login()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        log_message('debug', 'Email reçu : ' . $email);

        // Charger le modèle utilisateur
        $utilisateurModel = new UtilisateurModel();

        // Vérifie si l'utilisateur existe avec cet email
        $user = $utilisateurModel->where('LOWER(email)', strtolower($email))->first();