app/Controllers/ProfileController.php

    public function index(): string
    {
        $session = session();
        $user = $session->get('user');
        if (!$user) {
            return redirect()->to('/')->with('error', 'Veuillez vous connecter.');
        }
        $utilisateurModel = new UtilisateurModel();
        $utilisateur = $utilisateurModel->find($user['id']);
---
SELECT *
FROM `utilisateur`
WHERE `utilisateur`.`id` = '76'