app/Controllers/ReservationController.php

    public function index(): string
    {
        $session = session();
        $user = $session->get('user');
        if (!$user) {
            return redirect()->to('/')->with('error', 'Veuillez vous connecter.');
        }
        $utilisateurModel = new UtilisateurModel();
        $utilisateur = $utilisateurModel->find($user['id']);
        if (!$utilisateur) {
            return redirect()->to('/')->with('error', 'Utilisateur introuvable.');
        }

        $reservationModel = new ReservationsModel();
        $terrainModel = new TerrainsModel();
        $creneauModel = new CreneauModel();

        $terrains = $terrainModel->findAll();
        $creneaux = $creneauModel->findAll();
        $creneauxDisponibles = $creneauModel->where('disponible', true)->findAll();
        $reservations = $reservationModel->where('joueur_id', $user['id'])->findAll();
---
SELECT *
FROM `utilisateur`
WHERE `utilisateur`.`id` = '76'
SELECT *
FROM `terrains`
SELECT *
FROM `creneau`
SELECT *
FROM `creneau`
WHERE `disponible` = 1
SELECT *
FROM `reservations`
WHERE `joueur_id` = '76'

    public function delete($id)
    {
        $reservationModel = new ReservationsModel();
        $creneauModel = new CreneauModel();
        $reservation = $reservationModel->find($id);
        if (!$reservation) {
            return redirect()->back()->with('error', 'Réservation non trouvée.');
        }
        $deleteSuccess = $reservationModel->delete($id);
        if ($deleteSuccess) {
            $creneauUpdateSuccess = $creneauModel->update($reservation['creneau_id'], ['disponible' => 1]);
---
DELETE FROM `reservations`
WHERE `id` IN ('61')
UPDATE `creneau` SET `disponible` = 1, `updated_at` = '2024-12-07 18:01:48'
WHERE `creneau`.`id` IN ('1')

    public function edit($id)
    {
        $session = session();
        $user = $session->get('user');

        if (!$user || !isset($user['id'])) {
            return redirect()->to('/')->with('error', 'Vous devez être connecté pour modifier une réservation.');
        }

        $reservationModel = new ReservationsModel();
        $reservation = $reservationModel->find($id);
---
SELECT *
FROM `reservations`
WHERE `reservations`.`id` = '61'