app/Models/ReservationssModel.php

    public function getAllReservationsWithDetails()
    {
        return $this->db->table('reservations')
            ->select('
                joueur.nom AS joueur_name,
                terrains.type_sport AS terrains_type,
                terrains.localisation AS terrains_localisation,
                creneau.date AS date,
                creneau.heure_debut AS heure_debut,
                creneau.heure_fin AS heure_fin,
                reservations.statut AS statut,
                reservations.id AS id
            ')
            ->join('joueur', 'reservations.joueur_id = joueur.id')
            ->join('terrains', 'reservations.terrain_id = terrains.id')
            ->join('creneau', 'reservations.creneau_id = creneau.id')
            ->get()
            ->getResultArray();
---
SELECT `joueur`.`nom` AS `joueur_name`, `terrains`.`type_sport` AS `terrains_type`, `terrains`.`localisation` AS `terrains_localisation`, `creneau`.`date` AS `date`, `creneau`.`heure_debut` AS `heure_debut`, `creneau`.`heure_fin` AS `heure_fin`, `reservations`.`statut` AS `statut`, `reservations`.`id` AS `id`
FROM `reservations`
JOIN `joueur` ON `reservations`.`joueur_id` = `joueur`.`id`
JOIN `terrains` ON `reservations`.`terrain_id` = `terrains`.`id`
JOIN `creneau` ON `reservations`.`creneau_id` = `creneau`.`id`

    public function getReservationCounts()
    {
        $totalReservations = $this->countAll();

        $confirmedReservations = $this->where('statut', 'confirmée')->countAllResults();
        $pendingReservations = $this->where('statut', 'en attente')->countAllResults();
---
SELECT COUNT(*) AS `numrows` FROM `reservations`
SELECT COUNT(*) AS `numrows`
FROM `reservations`
WHERE `statut` = 'confirmée'
SELECT COUNT(*) AS `numrows`
FROM `reservations`
WHERE `statut` = 'en attente'